In [1]:
import pandas as pd

NameError: name 'path2' is not defined

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as san

In [5]:
Bank_path=r"bank.csv"
Visa_path=r"Visadataset.csv"

In [9]:
bank_data=pd.read_csv(Bank_path)
print(bank_data)

     age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0     30;"unemployed";"married";"primary";"no";1787;...
1     33;"services";"married";"secondary";"no";4789;...
2     35;"management";"single";"tertiary";"no";1350;...
3     30;"management";"married";"tertiary";"no";1476...
4     59;"blue-collar";"married";"secondary";"no";0;...
...                                                 ...
4516  33;"services";"married";"secondary";"no";-333;...
4517  57;"self-employed";"married";"tertiary";"yes";...
4518  57;"technician";"married";"secondary";"no";295...
4519  28;"blue-collar";"married";"secondary";"no";11...
4520  44;"entrepreneur";"single";"tertiary";"no";113...

[4521 rows x 1 columns]

In [7]:
visa_data=pd.read_csv(Visa_path)
print(visa_data)

         case_id continent education_of_employee has_job_experience  \
0         EZYV01      Asia           High School                  N
1         EZYV02      Asia              Master's                  Y
2         EZYV03      Asia            Bachelor's                  N
3         EZYV04      Asia            Bachelor's                  N
4         EZYV05    Africa              Master's                  Y
...          ...       ...                   ...                ...
25475  EZYV25476      Asia            Bachelor's                  Y
25476  EZYV25477      Asia           High School                  Y
25477  EZYV25478      Asia              Master's                  Y
25478  EZYV25479      Asia              Master's                  Y
25479  EZYV25480      Asia            Bachelor's                  Y

      requires_job_training  no_of_employees  yr_of_estab  \
0                         N            14513         2007
1                         N             2412         2002
2                         Y            44444         2008
3                         N               98         1897
4                         N             1082         2005
...                     ...              ...          ...
25475                     Y             2601         2008
25476                     N             3274         2006
25477                     N             1121         1910
25478                     Y             1918         1887
25479                     N             3195         1960

      region_of_employment  prevailing_wage unit_of_wage full_time_position  \
0                     West         592.2029         Hour                  Y
1                Northeast       83425.6500         Year                  Y
2                     West      122996.8600         Year                  Y
3                     West       83434.0300         Year                  Y
4                    South      149907.3900         Year                  Y
...                    ...              ...          ...                ...
25475                South       77092.5700         Year                  Y
25476            Northeast      279174.7900         Year                  Y
25477                South      146298.8500         Year                  N
25478                 West       86154.7700         Year                  Y
25479              Midwest       70876.9100         Year                  Y

      case_status
0          Denied
1       Certified
2          Denied
3          Denied
4       Certified
...           ...
25475   Certified
25476   Certified
25477   Certified
25478   Certified
25479   Certified

[25480 rows x 12 columns]

In [19]:
Bank_path=r"bank.csv"
bank_data=pd.read_csv(Bank_path,sep=';')
print(bank_data)

      age            job  marital  education default  balance housing loan  \
0      30     unemployed  married    primary      no     1787      no   no
1      33       services  married  secondary      no     4789     yes  yes
2      35     management   single   tertiary      no     1350     yes   no
3      30     management  married   tertiary      no     1476     yes  yes
4      59    blue-collar  married  secondary      no        0     yes   no
...   ...            ...      ...        ...     ...      ...     ...  ...
4516   33       services  married  secondary      no     -333     yes   no
4517   57  self-employed  married   tertiary     yes    -3313     yes  yes
4518   57     technician  married  secondary      no      295      no   no
4519   28    blue-collar  married  secondary      no     1137      no   no
4520   44   entrepreneur   single   tertiary      no     1136     yes  yes

       contact  day month  duration  campaign  pdays  previous poutcome   y
0     cellular   19   oct        79         1     -1         0  unknown  no
1     cellular   11   may       220         1    339         4  failure  no
2     cellular   16   apr       185         1    330         1  failure  no
3      unknown    3   jun       199         4     -1         0  unknown  no
4      unknown    5   may       226         1     -1         0  unknown  no
...        ...  ...   ...       ...       ...    ...       ...      ...  ..
4516  cellular   30   jul       329         5     -1         0  unknown  no
4517   unknown    9   may       153         1     -1         0  unknown  no
4518  cellular   19   aug       151        11     -1         0  unknown  no
4519  cellular    6   feb       129         4    211         3    other  no
4520  cellular    3   apr       345         2    249         7    other  no

[4521 rows x 17 columns]

In [15]:
Visa_path=r"Visadataset.csv"
visa_data=pd.read_csv(Visa_path,sep=';')
print(visa_data)

      case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0      EZYV01,Asia,High School,N,N,14513,2007,West,59...
1      EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,8...
2      EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122...
3      EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434....
4      EZYV05,Africa,Master's,Y,N,1082,2005,South,149...
...                                                  ...
25475  EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,...
25476  EZYV25477,Asia,High School,Y,N,3274,2006,North...
25477  EZYV25478,Asia,Master's,Y,N,1121,1910,South,14...
25478  EZYV25479,Asia,Master's,Y,Y,1918,1887,West,861...
25479  EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwes...

[25480 rows x 1 columns]

In [21]:
visa_data.shape

(25480, 1)

In [31]:
visa_data.size
print(len(str(visa_data.size)))

5

In [37]:
visa_data['case_id'].dtype
# print(len(str(visa_data.dtype)))

KeyError: 'case_id'

In [21]:
visa_data.columns

Index(['case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status'], dtype='object')

In [29]:
visa_data.drop_duplicates()

      case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0      EZYV01,Asia,High School,N,N,14513,2007,West,59...
1      EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,8...
2      EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122...
3      EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434....
4      EZYV05,Africa,Master's,Y,N,1082,2005,South,149...
...                                                  ...
25475  EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,...
25476  EZYV25477,Asia,High School,Y,N,3274,2006,North...
25477  EZYV25478,Asia,Master's,Y,N,1121,1910,South,14...
25478  EZYV25479,Asia,Master's,Y,Y,1918,1887,West,861...
25479  EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwes...

[25480 rows x 1 columns]

In [27]:
visa_data.isnull()

       case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0                                                  False
1                                                  False
2                                                  False
3                                                  False
4                                                  False
...                                                  ...
25475                                              False
25476                                              False
25477                                              False
25478                                              False
25479                                              False

[25480 rows x 1 columns]

In [31]:
visa_data.isnull().sum()

case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status    0
dtype: int64

In [37]:
visa_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 1 columns):
 #   Column                                                                                                                                                                                         Non-Null Count  Dtype
---  ------                                                                                                                                                                                         --------------  -----
 0   case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status  25480 non-null  object
dtypes: object(1)
memory usage: 199.2+ KB

In [51]:
visa_data.columns().index()

TypeError: 'Index' object is not callable

In [57]:
aa=visa_data.columns.index('case_status')
aa

AttributeError: 'Index' object has no attribute 'index'

In [59]:
idx = visa_data.columns.index('case_status')
print(idx)

AttributeError: 'Index' object has no attribute 'index'

In [47]:
list(visa_data.columns)

['case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status']

In [61]:
print(repr(visa_data.columns.tolist()))

['case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status']

In [63]:
visa_data.columns = visa_data.columns.str.strip()

In [69]:
visa_data.columns.to_list()

['case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status']

In [71]:
df1=visa_data.copy()

In [73]:
df1

      case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0      EZYV01,Asia,High School,N,N,14513,2007,West,59...
1      EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,8...
2      EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122...
3      EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434....
4      EZYV05,Africa,Master's,Y,N,1082,2005,South,149...
...                                                  ...
25475  EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,...
25476  EZYV25477,Asia,High School,Y,N,3274,2006,North...
25477  EZYV25478,Asia,Master's,Y,N,1121,1910,South,14...
25478  EZYV25479,Asia,Master's,Y,Y,1918,1887,West,861...
25479  EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwes...

[25480 rows x 1 columns]

In [75]:
df1.shape

(25480, 1)

- series is a key : value pair

- series can form a dictionary when we type cas dict

- series can also easly conert into dataframe

In [78]:
visa_data.dtypes

case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status    object
dtype: object

In [80]:
pd.DataFrame(visa_data.dtypes)
# task : how to make index as a column

                                                         0
case_id,continent,education_of_employee,has_job...  object

In [82]:
df1 = df1.reset_index()
# df1.columns = ["ColumnName", "DataType"]  # Rename columns (optional)
df1

,index,"case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status"
0,0,"EZYV01,Asia,High School,N,N,14513,2007,West,59..."
1,1,"EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,8..."
2,2,"EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122..."
3,3,"EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434...."
4,4,"EZYV05,Africa,Master's,Y,N,1082,2005,South,149..."
...,...,...
25475,25475,"EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,..."
25476,25476,"EZYV25477,Asia,High School,Y,N,3274,2006,North..."
25477,25477,"EZYV25478,Asia,Master's,Y,N,1121,1910,South,14..."
25478,25478,"EZYV25479,Asia,Master's,Y,Y,1918,1887,West,861..."
25479,25479,"EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwes..."

In [84]:
# df1.reset_index(inplace=True)
df1.rename(columns={'index':'columns'},inplace=True)
df1

,columns,"case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status"
0,0,"EZYV01,Asia,High School,N,N,14513,2007,West,59..."
1,1,"EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,8..."
2,2,"EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122..."
3,3,"EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434...."
4,4,"EZYV05,Africa,Master's,Y,N,1082,2005,South,149..."
...,...,...
25475,25475,"EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,..."
25476,25476,"EZYV25477,Asia,High School,Y,N,3274,2006,North..."
25477,25477,"EZYV25478,Asia,Master's,Y,N,1121,1910,South,14..."
25478,25478,"EZYV25479,Asia,Master's,Y,Y,1918,1887,West,861..."
25479,25479,"EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwes..."

In [86]:
visa_data.dtypes.to_dict()

{'case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status': dtype('O')}

In [88]:
visa_data.dtypes.to_dict().keys()

dict_keys(['case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status'])

In [92]:
visa_data.dtypes.to_dict().values()

dict_values([dtype('O')])

In [94]:
list(visa_data.dtypes.to_dict().values())

[dtype('O')]

In [96]:
visa_data.dtypes.to_dict()

{'case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status': dtype('O')}

In [98]:
# visa_data.dtypes.to_dict().keys()
types=visa_data.dtypes.to_dict().values()
coln=visa_data.dtypes.to_dict().keys()
for i in types:
    print(i)

object

In [100]:
# visa_data.dtypes.to_dict().keys()
types=visa_data.dtypes.to_dict().values()
coln=visa_data.dtypes.to_dict().keys()
for i in coln:
    print(i)

case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status

In [102]:
visa_data.dtypes.to_dict().items()

dict_items([('case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status', dtype('O'))])

In [104]:
# visa_data.dtypes.to_dict().keys()
for i, j in visa_data.dtypes.to_dict().items():
    if j == 'object':
        print(i)

case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status

In [106]:
cat=[]
num=[]
data_types=visa_data.dtypes.to_dict().items()
for i , j in data_types:
    if j=='object':
        cat.append(i)
    else:
        num.append(i)
print(list(cat))
print(list(num))

['case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status']
[]

In [108]:
data_types=visa_data.dtypes.to_dict().items()
cat=[i for i,j if j == 'object' ]
cat

SyntaxError: expected 'else' after 'if' expression (2866962324.py, line 2)

In [112]:
visa_data.select_dtypes(include='object').columns

Index(['case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status'], dtype='object')

In [114]:
visa_data.select_dtypes(exclude='object').columns

Index([], dtype='object')